PeterShin-pshin45/hw_11/MovieApp_Authentication/app/controllers/users_controller.rb

  def add_movie
    movie = Movie.find(params[:id])
    if !current_user.movies.include?(movie)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "2"]]
SELECT 1 AS one FROM "movies" INNER JOIN "movies_users" ON "movies"."id" = "movies_users"."movie_id" WHERE "movies_users"."user_id" = ? AND "movies"."id" = 2 LIMIT 1  [["user_id", 2]]

  def remove_movie
    movie = Movie.find(params[:id])
    if current_user.movies.include?(movie)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "2"]]
SELECT 1 AS one FROM "movies" INNER JOIN "movies_users" ON "movies"."id" = "movies_users"."movie_id" WHERE "movies_users"."user_id" = ? AND "movies"."id" = 2 LIMIT 1  [["user_id", 2]]