PeterShin-pshin45/hw_11/MovieApp_Authentication/app/views/movies/_list.html.erb

SELECT "movies".* FROM "movies" WHERE (title LIKE '%%' OR description LIKE '%%' OR year_released LIKE '%%')
SELECT 1 AS one FROM "movies" INNER JOIN "movies_users" ON "movies"."id" = "movies_users"."movie_id" WHERE "movies_users"."user_id" = ? AND "movies"."id" = 1 LIMIT 1  [["user_id", 2]]
---
    <% if user_signed_in? %>
      <% if current_user.movies.include? movie %>