PeterShin-pshin45/hw_9/MovieApp/app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(safe_movie_params)
    if @movie.save
---
INSERT INTO "movies" ("created_at", "description", "title", "updated_at", "year_released") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 09 Jan 2016 04:26:24 UTC +00:00], ["description", "this is a test"], ["title", "test"], ["updated_at", Sat, 09 Jan 2016 04:26:24 UTC +00:00], ["year_released", 1900]]

  def update
    @movie.update(safe_movie_params)
---
UPDATE "movies" SET "title" = ?, "description" = ?, "year_released" = ?, "updated_at" = ? WHERE "movies"."id" = 22  [["title", "test title"], ["description", "test description"], ["year_released", 2015], ["updated_at", Sat, 09 Jan 2016 07:15:00 UTC +00:00]]

    def load_movie
      @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE (title LIKE '%3%' OR description LIKE '%3%' OR year_released LIKE '%3%' OR rating LIKE '%3%')