EekedeMilliano-edmilliano/hw_8/twitter_app/app/controllers/hashtags_controller.rb

SELECT "hashtags".* FROM "hashtags"
---
  def new
  	@hashtags = Hashtag.all