EekedeMilliano-edmilliano/hw_8/twitter_app/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" WHERE (text LIKE '%%')
---
    def load_movie
      @tweets = Tweet.find params[:id]