Bylova-lyolik579/Homework7/MovieApp/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."title" IS NULL LIMIT 1
---
  def show
    @movie = Movie.find_by_title(params[:title])