Bylova-lyolik579/Homework7/MovieApp/app/controllers/movies_controller.rb

  def index
    @movies = Movie.all()
---
SELECT "movies".* FROM "movies"

  def create
     @movie = Movie.new(safe_movie_params)
    if @movie.save
---
INSERT INTO "movies" ("created_at", "description", "title", "updated_at", "year_released") VALUES (?, ?, ?, ?, ?)

  def update
    if @movie.update(safe_movie_params)
---
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = 22  [["description", "aaaaaaaaaaaaaaa"], ["updated_at", Fri, 08 Jan 2016 08:02:42 UTC +00:00]]

  def load_movie
   @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "show"]]