PeterShin-pshin45/hw_10/twitter_app/app/controllers/hashtags_controller.rb

SELECT "hashtags".* FROM "hashtags" WHERE (name LIKE '%%')
---
  def load_hashtag
    @hashtag = Hashtag.find(params[:id])