PeterShin-pshin45/hw_10/twitter_app/app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", "HELLLOOO"], ["created_at", "2016-01-20 23:37:31.342900"], ["updated_at", "2016-01-20 23:37:31.342900"]]
---
  def create
    @tweet = Tweet.new(safe_tweet_params)
    if @tweet.save

SELECT "tweets".* FROM "tweets" WHERE (text LIKE '%%')
---
  def load_tweet
    @tweet = Tweet.find(params[:id])