PeterShin-pshin45/hw_10/twitter_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def load_user
    @user = User.find(params[:id])